{
        "content_id": "1",
        "content_heading": "Introduction",
        "content_url": "introduction",
        "content_short_description": "",
        "content_page_title": "About Us || Nepal Medical Association",
        "content_attachment": "",
        "parent_id": "0",
        "content_meta_tags": "About Us || Nepal Medical Association",
        "content_meta_description": "About Us || Nepal Medical Association",
        "content_description": "<p>Nepal Medical Association (NMA)&nbsp;is a non-profit national professional organization of Medical and Dental Doctors in Nepal. Established on 20th Falgun, 2007 BS (4th March, 1951) with a few as 20 members, it has evolved into a large organization with more than ten thousand members under it&#39;s umbrella. The Founder President of the NMA was Dr. Siddhi Mani A. Dixit. It has the honour of being the first professional organization of the nation. NMA has been playing an important role in the development of medical science and is acting as a linkage between the government and the medical professionals. The current 28th NMA Executive was elected in 2020 February 28 with Dr. LochanKarki and Dr. BadriRijal as President and General Secretary respectively. It has its central office in Kathmandu and 16 branches around the country.</p>\r\n\r\n<p>NMA has been regularly publishing a medical journal on monthly basis and organizing scientific sessions to make the medical professionals fully up-to-date with the advances in medical science. It has been striving with great zeal for the common interests of the medical profession and has thus contributed significantly towards the overall improvement of the health situation in the country. The lifelong dedication, commitment and devotion of many of our senior colleagues and friends has enabled this organization to come to this present status. It is mutually affiliated with Indian Medical Association and is a founder member of the South Asian Medical Association (SAMA). NMA is member of World Medical Association (WMA) and Confederation of Medical Associations in Asia and Oceania (CMAAO).</p>\r\n\r\n<p>NMA has been publishing PubMed indexed scientific publication,&nbsp;Journal of Nepal Medical Association&nbsp;since 1963.&nbsp;The current JNMA Chief Editor is Dr. Angel Magar since 2013. The Chief Editor is nominated executive member to the Nepal Medical Association. Dr Angel Magar has been working in the field of journology since 2004. He helped index three journals from Nepal - Kathmandu University Medical Journal in 2004, Journal of Nepal Medical Association in 2005 and Journal of Nepal Health Research Council in 2010. He has helped establish many journals in Nepal and also first medical journal in Bhutan - Bhutan Health Journal in 2015.</p>",
        "show_in": "",
        "created_on": "2018-04-03 08:28:58",
        "updated_on": "2020-08-25 19:40:18",
        "updated_by": "1",
        "show_order": "0",
        "is_active": "1",
        "deleted": "0",
        "language_id": "1"
    }